const minus = require('./minus');

// 5 - 10 เท่ากับ -5
test('5 - 10 เท่ากับ -5', ()=> {
    expect(minus(5,10)).toBe(-5);
})

// 20 - 10 เท่ากับ 10
test('20 - 10 เท่ากับ 10', ()=> {
    expect(minus(20,10)).toBe(10);
})

// 7 - 3 เท่ากับ 4
test('7 - 3 เท่ากับ 4', ()=> {
    expect(minus(7,3)).toBe(4);
})

// 40 - -30 เท่ากับ 70
test('40 - -30 เท่ากับ 70', ()=> {
    expect(minus(40,-30)).toBe(70);
})

// -12 - -11 เท่ากับ -1
test('-12 - -11 เท่ากับ -1', ()=> {
    expect(minus(-12,-11)).toBe(-1);
})