const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21',()=> {
  expect(sum(20,1)).toBe(21);
})

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ 7', ()=> {
  expect(sum(2,5)).toBe(7);
})

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy
// 5 + 10 เท่ากับ 15
test('12 + 7 เท่ากับ 19', ()=> {
  expect(sum(12,7)).toBe(19);
})

// 5 + 10 เท่ากับ 15
test('5 + 10 เท่ากับ 15', ()=> {
  expect(sum(5,10)).toBe(15);
})

// 4 + 1 เท่ากับ 5
test('4 + 1 เท่ากับ 5', ()=> {
  expect(sum(4,1)).toBe(5);
})